espressif/esp-bist/samples/idf/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
# Enable ULP
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=16240
# Set log level to Warning to produce clean output
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2
# BIST configuration
CONFIG_ESP_BIST=y
CONFIG_ESP_BIST_CPU_REG_TEST=y
CONFIG_ESP_BIST_CPU_CSR_REG_TEST=y
CONFIG_ESP_BIST_STACK_TEST=y
CONFIG_ESP_BIST_MEMORY_RAM_TEST=y
CONFIG_ESP_BIST_MEMORY_FLASH_TEST=y
CONFIG_ESP_BIST_WDT_TIMEOUT_US=50000
